[
  {"question": "What was the most creative idea you introduced on the job? How did you persuade your superior?"},
  {"question": "Describe a time when voicing your opinion was uncomfortable or could have had serious consequences, but you did it because you believed so strongly in the value of your perspective."},
  {"question": "Give me an example of the most complex project/assignment you have had, including your role and the outcome."},
  {"question": "Describe a situation at work when you had to make a decision and were uncertain about the outcome."},
  {"question": "What do you do when you are communicating with someone and it becomes apparent that they don’t understand what you’re saying or vice versa?"},
  {"question": "Describe a situation in which you developed a group into a strong working team."},
  {"question": "What important goals have you set in the past and how you accomplished them successfully?"},
  {"quesiton": "Describe a time when you had to sell an idea to your manager or another authority figure."},
  {"question": "Give me an example taken from your experiences in report writing, preparation of memos, or general correspondence which illustrates the extent of your written communication skills."},
  {"question": "Solving problems requires more than good plans; it means taking action. Give me an example of a time when you were able to take meaningful action to resolve a problem."},
  {"question": "Sometimes it is necessary to work in unsettled or rapidly changing circumstances. When have you found yourself in this position? Tell me exactly what you did and the outcome."},
  {"question": "Tell me about a time when you had to cope with strict deadlines or time demands."},
  {"question": "How have you improved existing processes and procedures?"},
  {"question": "How have you improved existing processes and procedures?"},
  {"question": "Give me an example of a time when others have been able to count on you “being there” time after time, project after project."},
  {"question": "What do you see as your biggest professional success to date?"}
  ]